name: "LeNet"
layer {
  name: "data"
  type: "MemoryData"
  top: "data"
  top: "label"
  memory_data_param {
   batch_size: 64
   channels: 1
   height: 28
   width: 28
   label: 10
  }
  transform_param 
  {
      scale: 0.00390625
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
#layer
#{
#    name: "relu1"
#    type: "ReLU"
#    bottom: "conv1"
#    top: "conv1"
#}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
#layer
#{
#    name: "relu2"
#    type: "ReLU"
#    bottom: "conv2"
#    top: "conv2"
#}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool2"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
#layer {
#    name: "bn1"
#    type: "BatchNorm"
#    bottom: "ip2"
#    top: "bn1"
#    param {
#    lr_mult: 0
#    }
#    param {
#    lr_mult: 0
#    }
#    param {
#    lr_mult: 0
#    }
#
#}
#layer
#{
#    name: "n1"
#    type: "Normalize"
#    bottom: "ip2"
#    top: "n1"
#}
#layer {
#  name: "loss"
#  type: "EuclideanLoss"
#  bottom: "ip2"
#  bottom: "label"
#  top: "loss"
#}
#layer {
#  name: "loss"
#  type: "SmoothL1Loss"
#  bottom: "n1"
#  bottom: "label"
#  top: "loss"
#}
layer
{
  name: "loss"
  type: "HingeLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
